import pytest
from unittest.mock import patch

from main import main


@pytest.mark.parametrize(
    "user_inputs, expected_output",
    [
        (["1", "EXECUTED", "нет", "нет", "нет"], "Распечатываю итоговый список транзакций..."),
        (["2", "EXECUTED", "нет", "нет", "нет"], "Распечатываю итоговый список транзакций..."),
        (["3", "EXECUTED", "нет", "нет", "нет"], "Распечатываю итоговый список транзакций..."),
        (["4", "1", "EXECUTED", "нет", "нет", "нет"], "Выбран неверный формат файла"),
        (["1", "бубугага", "EXECUTED", "нет", "нет", "нет"], "Распечатываю итоговый список транзакций..."),
        (["1", "EXECUTED", "да", "по возрастанию", "нет", "нет"], "Распечатываю итоговый список транзакций..."),
        (["1", "EXECUTED", "да", "по убыванию", "нет", "нет"], "Распечатываю итоговый список транзакций..."),
        (
            ["1", "EXECUTED", "да", "бубугага", "да", "по убыванию", "нет", "нет"],
            "Распечатываю итоговый список транзакций...",
        ),
        (["1", "EXECUTED", "нет", "да", "нет"], "Распечатываю итоговый список транзакций..."),
        (["1", "EXECUTED", "нет", "бубугага", "да", "нет"], "Распечатываю итоговый список транзакций..."),
        (["1", "EXECUTED", "нет", "нет", "да", "перевод"], "Распечатываю итоговый список транзакций..."),
        (
            ["1", "EXECUTED", "нет", "нет", "да", "бубугага"],
            "Не найдено ни одной транзакции, подходящей под ваши условия фильтрации",
        ),
    ],
)
def test_main(capsys, user_inputs, expected_output):
    with patch("builtins.input", side_effect=user_inputs):
        main()

    captured = capsys.readouterr()
    assert expected_output in captured.out
